{
  "events": [
    {
      "city_state": "New Brunswick, NJ",
      "copy": 0,
      "copyid": 0,
      "date": "2018-11-26T06:15:00.000Z",
      "end_date": "2018-12-09T04:00:00.000Z",
      "expiry": "2018-12-10T04:30:00.000Z",
      "facebook_pubstatus": 0,
      "facebook_pubstatus_page2": 0,
      "fbprofile2_pubstatus": 0,
      "fbprofile_pubstatus": 0,
      "fdfNte": "",
      "full_address": "13 Paterson Street, New Brunswick, NJ 08901",
      "id": "",
      "images": "Bollywood-Night-New-Jersey.jpg",
      "images2": "107220thumbnai_1542278985.jpg",
      "imgVisibility": "",
      "language": "",
      "name": "",
      "news": "<br>",
      "news2": "",
      "newsHde": "Bollywood Night – New Jersey",
      "pdf": "",
      "slider": 0,
      "start_date": "2018-12-08T22:00:00.000Z",
      "status_cur": 0,
      "status_mge": "53",
      "top": 0,
      "upddate": "2018-11-26T06:20:00.000Z",
      "writer": 0
    },
    {
      "city_state": "",
      "copy": 53,
      "copyid": 101065,
      "date": "2018-07-05T12:29:42.000Z",
      "end_date": "2000-01-25T05:00:00.000Z",
      "expiry": "2000-01-01T05:00:00.000Z",
      "facebook_pubstatus": 1,
      "facebook_pubstatus_page2": 1,
      "fbprofile2_pubstatus": 0,
      "fbprofile_pubstatus": 0,
      "fdfNte": "",
      "full_address": "",
      "id": "",
      "images": "",
      "images2": "101064thumbnai_1530880129.jpg",
      "imgVisibility": "",
      "language": "",
      "news": "Mumbai, July 6 Mumbai Bharatiya Janata Party (BJP) MP Gopal Shetty has stoked up a controversy by saying that Christians are 'angrez' (British) and did not contribute to the Indian freedom struggle.<br /> <br /> Though the senior most city leader made the remarks last Sunday at an Eid Milan function in Malad suburb, videos of his speech surfaced only on Thursday and went viral.<br /> <br /> Among other things, the Mumbai North MP said: \"Christians were 'angrez', hence they didn't join in the Indian freedom struggle. India was not freed by a Hindu or a Muslim, we fought as one for our Independence.\"<br /> <br /> Sharply criticizing Shetty, Maharashtra Congress President Ashok Chavan said: \"It reflects despicably communal mindset of the BJP. Freedom struggle is the epitome of sacrifices made by all communities including Christians. Shetty must know that only RSS was in support of the British.\"<br /> <br /> Condemning the \"anti-minority remarks\", Mumbai Congress President Sanjay Nirupam demanded that Shetty must tender \"an apology to the entire Christian community of India as he has no knowledge of history or the contribution of the Christians in the independence movement\".<br /> <br /> On Friday, All India Mahila Congress General Secretary Janet Desouza and Mumbai Mahila Congress President Ajanta Yadav held a protest outside Shetty's office in Borivali West.<br /> <br /> Two Christian residents from Malad - Mavis Fernandes and Jerard Lobo - submitted a written complaint against Shetty to police in Malvani, demanding action against the MP for promoting enmity between communities.<br /> <br /> Malvani Congress legislator Aslam Shaikh pointed out that though small in numbers, the Christian community contributed significantly to the freedom struggle and also in nation building.<br /> <br /> As the issue snowballed, Shetty on Thursday appeared to backtrack and said it was \"a miscommunication and misinterpretation\", adding that people from every religion contributed to the freedom struggle.<br /> <br /> Going further on the defensive on Friday, Shetty said \"he was a responsible person with a long political career behind him and would never think embarrassing the BJP top leadership\", hinting at submitting his resignation.<br /> <br /> However, on Friday, BJP state spokesperson Madhav Bhandari told the media that the party's top leaders and state BJP President Raosaheb Patil-Danve have spoken with Shetty and the party stood by him.<br /> <br /> Agitated members of the Christian community flooded the social media with names of prominent persons who had taken an active part in the freedom struggle, stood with leaders like Mahatma Gandhi and made many sacrifices on the personal and family fronts.<br /> <br /> They included Thevarthundiyil Titus and his wife Annamma, Accamma Cherian whom Gandhi called the 'Jhansi ki Rani of Travancore', Christian missionaries like Stanley Jones, C.F. Andrews, J.C. Wilson, Ernest Forrester-Paton, Ralph R. Keitahn, Varrier Elwin, John J. Cornelius, J.C. Kumarappa, Paul Ramaswamy, T.M. Verghese, A.J. John, Anne Mascarenhas, Joachim Alva and many more.<br /> <br />",
      "news2": "Mumbai Bharatiya Janata Party (BJP) MP Gopal Shetty has stoked up a controversy by saying that Christians are 'angrez' (British) and did not contribute to the Indian freedom struggle.",
      "newsHde": "Christians had no role in freedom struggle: BJP MP",
      "newsType": "events",
      "pdf": "",
      "slider": "",
      "start_date": "2000-01-25T05:00:00.000Z",
      "status_cur": 1,
      "status_mge": 53,
      "top": "",
      "upddate": "2000-01-25T05:00:00.000Z",
      "writer": 0
    }
  ]
}